emas/loadtest/emas-performance-report/raw_data/sp1/1000cus/varnish_ab_test_1000_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      1000
Time taken for tests:   0.098 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    10249.79 [#/sec] (mean)
Time per request:       97.563 [ms] (mean)
Time per request:       0.098 [ms] (mean, across all concurrent requests)
Transfer rate:          325831.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       24   28   3.6     27      38
Processing:    29   47  11.2     45      64
Waiting:       11   29  11.2     27      47
Total:         66   76   9.4     71      94

Percentage of the requests served within a certain time (ms)
  50%     71
  66%     76
  75%     88
  80%     89
  90%     91
  95%     93
  98%     93
  99%     94
 100%     94 (longest request)